testcase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            slip;
    }
    in
    {
        type            freestreamPressure;
    }
    out
    {
        type            freestreamPressure;
    }
    bottom_symW
    {
        type            slip;
    }
    bottom_pillar
    {
		//type	slip;
        type            zeroGradient;
    }
    channel
    {
        type            slip;
    }
}


// ************************************************************************* //
