testcase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

//method          simple;
//method          hierarchical;
method          scotch;

simpleCoeffs 
{ 
  n               (4 1 1); 
  delta           0.001; 
} 

hierarchicalCoeffs 
{ 
  n               (4 1 1); 
  delta           0.001;
  order 		  yxz; 
} 


//preserveFaceZones
//(
//"sensor_1_faceZone"
//);




// ************************************************************************* //
